# Copyright (c) OpenMMLab. All rights reserved.
from mmseg.registry import DATASETS
from .basesegdataset import BaseSegDataset


@DATASETS.register_module()
class ATL_S2_EuroCrops_Dataset_65class(BaseSegDataset):

    METAINFO = dict(
        classes=('非农田', '其他作物', '冬季普通软麦', '春季普通软麦', '冬季硬质小麦', '冬季黑麦', '冬季大麦',
                 '春季大麦', '燕麦', '春季燕麦', '谷物、玉米、爆米花', '小黑麦', '冬季小麦黑麦杂交种',
                 '小米、高粱', '荞麦', '大豆、大豆类', '干豆类、蛋白作物', '豆类', '豌豆', '马铃薯',
                 '冬季油菜籽', '向日葵', '亚麻布', '大麻', '香料、药用、烹饪植物、香料、草药', '玉米青贮',
                 '采收的豆类青饲料', '花卉、观赏植物', '羊草', '黑麦草', '苜蓿、车轴草', '三叶草',
                 '牧场、草地、草场、草', '新鲜蔬菜', '厨房花园', '草莓', '黄瓜', '南瓜、西葫芦、葫芦', '芦笋',
                 '菜花', '白菜', '大蒜', '韭菜', '洋葱', '甜菜根', '胡萝卜', '甜菜根', '甜菜', '菊苣',
                 '菠菜', '果园、水果', '苹果', '黑加仑', '树莓', '葡萄园、葡萄酒藤、葡萄区、葡萄',
                 '蘑菇、能源、转基因作物', '苗圃', '温室铝箔、薄膜', '树木、木材、森林', '造林/重新造林', '杨树',
                 '其他耕地作物', '其他永久作物、种植园', '休耕地、非作物', '未维护的'),
        palette=[[255, 255, 255], [190, 190, 190], [6, 230, 230], [80, 50, 50],
                 [4, 200, 3], [120, 120, 80], [140, 140, 140], [204, 5, 255],
                 [230, 230, 230], [4, 250, 7], [224, 5, 255], [235, 255, 7],
                 [150, 5, 61], [120, 120, 70], [8, 255, 51], [255, 6, 82],
                 [143, 255, 140], [204, 255, 4], [255, 51, 7], [204, 70, 3],
                 [0, 102, 200], [61, 230, 250], [255, 6, 51], [11, 102, 255],
                 [255, 7, 71], [255, 9, 224], [9, 7, 230], [220, 220, 220],
                 [255, 9, 92], [112, 9, 255], [8, 255, 214], [7, 255, 224],
                 [255, 184, 6], [10, 255, 71], [255, 41, 10], [7, 255, 255],
                 [224, 255, 8], [102, 8, 255], [255, 61, 6], [255, 194, 7],
                 [255, 122, 8], [0, 255, 20], [255, 8, 41], [255, 5, 153],
                 [6, 51, 255], [235, 12, 255], [160, 150, 20], [0, 163, 255],
                 [140, 140, 140], [250, 10, 15], [20, 255, 0], [0, 0, 200],
                 [250, 0, 150], [0, 150, 200], [0, 200, 250], [150, 200, 250],
                 [250, 250, 250], [200, 200, 200], [200, 150, 150],
                 [250, 200, 150], [150, 150, 0], [250, 150, 150],
                 [250, 150, 0], [250, 200, 250], [200, 150, 0]])

    def __init__(self,
                 img_suffix='.tif',
                 seg_map_suffix='.tif',
                 reduce_zero_label=False,
                 ignore_index=255,
                 **kwargs) -> None:
        super().__init__(
            img_suffix=img_suffix,
            seg_map_suffix=seg_map_suffix,
            reduce_zero_label=reduce_zero_label,
            ignore_index=ignore_index,
            **kwargs)
